# Паттерн для смайликов
import re

emoji_pattern = re.compile("["
                           u"\U0001F600-\U0001F64F"  # эмодзи
                           u"\U0001F300-\U0001F5FF"  # символы и пиктограммы
                           u"\U0001F680-\U0001F6FF"  # символы транспорта и карты
                           u"\U0001F700-\U0001F77F"  # символы планет, зодиака и астрологии
                           u"\U0001F780-\U0001F7FF"  # символы, указывающие на категории
                           u"\U0001F800-\U0001F8FF"  # символы огненных пламеней
                           u"\U0001F900-\U0001F9FF"  # символы эмодзи дополнительной информации
                           u"\U0001FA00-\U0001FA6F"  # символы игральных карт
                           u"\U0001FA70-\U0001FAFF"  # символы утопичных существ
                           u"\U00002702-\U000027B0"  # дополнительные знаки пунктуации
                           u"\U000024C2-\U0001F251"
                           u"\U0001f926-\U0001f937"
                           u"\U00010000-\U0010ffff"
                           u"\u200d"
                           u"\u2640-\u2642"
                           u"\u2600-\u2B55"
                           u"\u23cf"
                           u"\u23e9"
                           u"\u231a"
                           u"\u3030"
                           u"\ufe0f"
                           "]+", flags=re.UNICODE)


def clean_text(text: str):
    vergul_clean = re.sub(r"\'\`", '', text)
    text = re.sub(r'\b\d\W*\/\W*\d\W*\/\W*\d\b', ' ', vergul_clean)
    text = re.sub(r'[^\w\s]', ' ', emoji_pattern.sub(r' ', text)).replace('\n', ' ')
    return text
